In [2]:
num1 = 5
num2 = 9
suma = num1 + num2
suma

14

Importamos la librer√≠a de pandas

In [4]:
import pandas as pd

Creamos datos para el DataFrame

In [6]:
datos = {
    'Nombres': ['Ana', 'Adrian', 'Lucia', 'Antonia'],
    'Edad': [23, 25, 12, 40],
    'Ciudades': ['Madrid', 'Sevilla', 'Toledo', 'Gijon']
    }

Creamos un DataFrame con los datos

In [8]:
df = pd.DataFrame(datos)
df

   Nombres  Edad Ciudades
0      Ana    23   Madrid
1   Adrian    25  Sevilla
2    Lucia    12   Toledo
3  Antonia    40    Gijon

Voy a filtrar datos por edad

In [9]:
df[df['Edad'] > 24]

   Nombres  Edad Ciudades
1   Adrian    25  Sevilla
3  Antonia    40    Gijon